from typing import List


a=[
    "Алёшенцев Тимофей Сергеевич",
    "Бушмакин Сергей Андреевич",
    "Васильев Александр Андреевич ",
    "Гмыра Елизавета Сергеевна ",
    "Губарев Никита Дмитриевич ",
    "Гурин Никита Сергеевич ",
    "Епихина Александра Вячеславовна ",
    "Ефремова Алиса Александровна ",
    "Каньшин Иван Алексеевич ",
    "Кныш Егор Алексеевич ",
    "Коренюгина Юлия Алексеевна ",
    "Корнеев Александр Сергеевич ",
    "Куртияков Владислав Евгеньевич ",
    "Максакова Анастасия Сергеевна ",
    "Меркушев Дмитрий Ярославович ",
    "Нарзулаев Руми Бободжонович ",
    "Науменко Семен Сергеевич ",
    "Орлов Ростислав Романович ",
    "Рыжков Вадим Андреевич ",
    "Соколовская Дарья Николаевна ",
    "Сталмацкий Павел Александрович ",
    "Степанова Вероника Андреевна ",
    "Шаповалова Арина Максимовна ",
    "Эбель Илья Евгеньевич ",
    "Яин Данил Дмитриевич"
]

def prepare(mylist:List):
    result = []
    for x in mylist:
        card={}
        card.append()
        
        #result.append()
    #return result

#prepare(a)

dial_codes = [
(880, 'Bangladesh'),
(55,'Brazil'),
(86, 'China'),
(91, 'India'),
(62,'Indonesia'),
(81, 'Japan'),
(234, 'Nigeria'),
(92, 'Pakistan'),
(7, 'Russia'),
(1, 'United States'), ]

country_dial = {country: code for code, country in dial_codes}
print(country_dial)

def function(required, *args, **kwargs):
    print(required)
    if args:
        print(args)
    if kwargs:
        print(kwargs)

function("hello", " world", name="!!!")

